Revit 2027 API
LoadOrientTo Enumeration
 Specifies load orientation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LoadOrientTo
Public Enumeration LoadOrientTo
public enum class LoadOrientTo
type LoadOrientTo
Members
Member name | Value | Description
HostLocalCoordinateSystem | 2 |  Load is oriented in respect to it analytical host element coordinate system and will follow host changes.
Project | 0 |  Load is oriented in respect to project global coordinate system, that is X to East, Y to North, and Z to up.
WorkPlane | 1 |  Load is oriented in respect to work plane.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace